systec-electronic/yocto-sysworxx/ctr700/ctr700-rev2.syscfg
iSPI1.$useCase                     = "SPI_1";
iSPI1.$name                        = "SPI0";
iSPI1.$assign                      = "SPI0";
iSPI1.$assignVoltage               = "3.3 V";
iSPI1.CLK.$assign                  = "SPI0_CLK";
iSPI1.D0.$assign                   = "SPI0_D0";
iSPI1.D1.$assign                   = "SPI0_D1";
iSPI1.CS0.$assign                  = "SPI0_CS0";
iSPI1.CS0.$used                    = false;
const iSYSTEM1                     = scripting.addPeripheral("SYSTEM");
iSYSTEM1.$name                     = "SYSTEM0";
iSYSTEM1.$assign                   = "SYSTEM0";
iSYSTEM1.$assignVoltage            = "3.3 V";
iSYSTEM1.CLKOUT0.$assign           = "EXT_REFCLK1";
iSYSTEM1.CLKOUT0.$used             = true;
iSYSTEM1.EXTINTn.$assign           = "EXTINTn";
iSYSTEM1.EXTINTn.$used             = true;
iSYSTEM1.PORz_OUT.$assign          = "PORz_OUT";
iSYSTEM1.RESETSTATz.$assign        = "RESETSTATz";
iSYSTEM1.RESET_REQz.$assign        = "RESET_REQz";
const iUART1                       = scripting.addPeripheral("UART");
iUART1.$useCase                    = "UART_5";
iUART1.$name                       = "UART0-Service";
iUART1.$assign                     = "USART0";
iUART1.$assignVoltage              = "3.3 V";
iUART1.RXD.$assign                 = "UART0_RXD";
iUART1.TXD.$assign                 = "UART0_TXD";
const iUART2                       = scripting.addPeripheral("UART");
iUART2.$useCase                    = "UART_2";
iUART2.$name                       = "UART5-SERIAL1";
iUART2.$assign                     = "USART5";
iUART2.$assignVoltage              = "3.3 V";
iUART2.RXD.$assign                 = "OSPI0_CSn2";
iUART2.TXD.$assign                 = "OSPI0_CSn3";
iUART2.CTSn.$assign                = "OSPI0_DQS";
iUART2.CTSn.$used                  = false;
iUART2.RTSn.$assign                = "OSPI0_LBCLKO";
iUART2.RTSn.$used                  = false;
const iUART3                       = scripting.addPeripheral("UART");
iUART3.$useCase                    = "UART_2";
iUART3.$name                       = "UART6-SERIAL2";
iUART3.$assign                     = "USART6";
iUART3.$assignVoltage              = "3.3 V";
iUART3.RXD.$assign                 = "VOUT0_DATA8";
iUART3.TXD.$assign                 = "VOUT0_DATA9";
iUART3.CTSn.$assign                = "VOUT0_DATA11";
iUART3.RTSn.$assign                = "VOUT0_DATA10";
const iUART4                       = scripting.addPeripheral("UART");
iUART4.$useCase                    = "UART_5";
iUART4.$name                       = "UART4-SERIAL0";
iUART4.$assign                     = "USART4";
iUART4.$assignVoltage              = "3.3 V";
iUART4.RXD.$assign                 = "VOUT0_DATA4";
iUART4.TXD.$assign                 = "VOUT0_DATA5";
const iUSB1                        = scripting.addPeripheral("USB");
iUSB1.$name                        = "USB0";
iUSB1.$assign                      = "USB0";
iUSB1.$assignVoltage               = "3.3 V";
iUSB1.DM.$assign                   = "USB0_DM";
iUSB1.DP.$assign                   = "USB0_DP";
iUSB1.DRVVBUS.$assign              = "USB0_DRVVBUS";
iUSB1.RCALIB.$assign               = "USB0_RCALIB";
iUSB1.VBUS.$assign                 = "USB0_VBUS";
const iWKUP_SYSTEM1                = scripting.addPeripheral("WKUP_SYSTEM");
iWKUP_SYSTEM1.$name                = "WKUP_SYSTEM";
iWKUP_SYSTEM1.$assign              = "WKUP_SYSTEM";
iWKUP_SYSTEM1.$assignVoltage       = "3.3 V";
iWKUP_SYSTEM1.WKUP_CLKOUT0.$assign = "WKUP_CLKOUT0";
iWKUP_SYSTEM1.PMIC_LPM_EN0.$used   = false;
